{
  "project": [
    {
      "id": "P1",
      "title": "Showroom-AI (2025.12)",
      "description": "이미지 한 장을 업로드하면 이를 기반으로 3D 모델, 홍보 영상, 변형 이미지, AI 챗봇 등을 자동 생성해 주는 웹 기반 콘텐츠 제작 플랫폼으로, 사용자가 다양한 레이아웃과 인터랙션을 통해 결과물을 직관적으로 확인할 수 있습니다. 프로젝트에서 바이브 코딩으로 템플릿을 생성하고 페이지의 일부 기능들을 구현하는 작업을 진행하였습니다.",
      "do": [
        "기존에는 스타일을 3개만 지원하며, 새로운 스타일을 추가할 때마다 직접 import & 등록해야 했는데, 스타일 확장성을 위해 동적 import를 사용해 스타일 파일을 생성하면 자동 등록되는 구조로 리팩터링",
        "기존에는 사이트에 하나의 스타일만 맵핑이 가능했는데 쿼리파라미터를 활용해 원하는 스타일을 모두 적용해볼 수 있도록 로직 수정"
      ],
      "tech": ["Next.js", "TypeScript"]
    },
    {
      "id": "P2",
      "title": "Animal Keeper (2025.11)",
      "description": "영유아용 도서의 QR을 통해 접속할 수 있는 웹 페이지로, 책에 등장하는 동물을 360도 회전으로 확인하고 클릭 시 행동과 이름을 한/영으로 확인할 수 있는 인터랙티브 콘텐츠를 제공합니다. 프로젝트에서 프론트엔드 화면 퍼블리싱을 전담하며, 기능 구현, 미디어쿼리와 애니메이션 작업을 포함해 다양한 UI/UX 요소를 최적화함으로써 직관적이고 몰입감 있는 사용자 경험을 제공하였습니다.",
      "do": [
        "디자인 요구사항에 따라 모든 텍스트를 SVG로 처리해야 했으나, 피그마에서 직접 추출한 SVG는 텍스트 하나당 약 70KB로 용량이 과도하게 크고 재사용이 불가능한 문제가 있었음. 이를 해결하기 위해 SVG 외곽 구조만 유지하고 내부 콘텐츠는 <text> 태그 기반으로 재구성하는 방식으로 로직을 개선함. 그 결과 파일 크기를 2KB 미만으로 축소함과 동시에 재사용 가능한 컴포넌트 구조를 구축함으로써 성능과 개발 효율성을 크게 향상시킴",
        "한영 변환 로직 구현, 쿠키에 변환된 상태를 저장하여 모든 페이지에서 한영 변환 기능을 수행할 수 있도록 로직 설계 및 구현",
        "오디오 버튼이 다양한 페이지와 기능에서 반복적으로 필요함을 고려하여, 공통 컴포넌트로 분리함. 컴포넌트에 src만 전달하고 버튼으로 감싸면 자동으로 오디오 재생 버튼으로 동작하도록 로직을 설계·구현함. 이를 통해 재사용성을 확보함과 동시에 코드 중복을 최소화함.",
        "react motion라이브러리를 활용하여 타켓층에 맞는 시각적인 애니메이션 구현"
      ],
      "tech": ["Next.js", "TypeScript"]
    },
    {
      "id": "P3",
      "title": "Figure AI (2025.04 - 2025.09)",
      "description": "프롬프트 없이 피규어 이미지를 생성할 수 있는 AI 기반 웹 서비스를 개발했습니다. 프로젝트에서 전체 퍼블리싱을 담당하며 UI 구조 설계부터 공통 컴포넌트 구축, 코드 리팩토링까지 프론트엔드 전반을 구현했습니다. 또한 이미지 생성 모델에 전달되는 입력값의 품질을 높이기 위해 이미지 비율을 자동으로 조절하는 기능을 포함해 주요 기능 개발에도 적극적으로 참여했습니다.",
      "do": [
        "유사한 역할을 수행하는 여러 페이지에 반복적으로 사용되던 로직을 함수와 공통 컴포넌트로 모듈화하여, 코드 중복을 제거하고 가독성과 유지보수성을 개선함.",
        "백엔드에서 데이터를 불러오거나 웹소켓으로 처리하는 로직이 많아서 이 부분에 대한 로딩 및 에러처리를 세분화함으로써 사용자가 이유 없이 기능이 작동하지 않는 경험을 최소화함.",
        "단일 화면에서 3D, 모델링, 영상 콘텐츠를 토글로 전환하는 UI 요구사항을 반영하기 위해, 쿼리 파라미터를 기반으로 각 콘텐츠의 렌더링 구조를 분리함. 이를 통해 콘텐츠 렌더링 시 불필요한 렌더링을 줄이고 부드러운 사용자 경험을 제공.",
        "SEO 최적화 및 sitemap.xml 생성하여 사이트 검색 노출 강화, 방문자 수 증가를 목표로 개선 작업을 진행하였음.",
        "캔버스와 useRef 기반 로직을 구현해 업로드된 이미지를 자동으로 정사각형 비율로 변환하는 로직 구현. 직사각형 이미지에는 여백을 추가해 비율을 맞추는 방식으로, AI 이미지 생성 모델에 안정적인 입력 형태를 제공함."
      ],
      "tech": ["Next.js", "TypeScript", "Prisma", "PostgreSQL"]
    },
    {
      "id": "P4",
      "title": "Onepager Buzz (2024.12 - 2025.01)",
      "description": "본 프로젝트는 글로벌 사용자를 대상으로 하는 다국어 기반 이벤트 페이지로, 국가별로 제공되는 언어 리소스를 체계적으로 관리하고 단일 코드베이스에서 효율적으로 렌더링하는 것을 목표로 진행되었습니다. 참여 국가 리스트가 매번 엑셀(xlsx) 형태로 제공되는 특성을 고려해, 데이터를 자동으로 가공·변환할 수 있는 구조를 설계하고, 국가 코드 기반으로 각 언어가 자연스럽게 매핑되어 로드되도록 페이지 구조를 최적화했습니다. 이를 통해 별도 코드 수정 없이도 다양한 언어 페이지가 즉시 생성될 수 있는 유연한 다국어 시스템을 구축했습니다.",
      "do": [
        "Node.js와 xlsx, fs를 활용해 엑셀 데이터를 JSON 형식으로 변환하는 로직 구현",
        "Next.js에서 제공하는 동적 라우팅 기능을 활용해 약 40개 언어를 지원하는 다국어 처리 로직을 구축.",
        "언어별 *.xlsx 리소스를 JSON으로 변환한 뒤 국가 코드 기반으로 매칭되도록 설계했으며, 라우트에 포함된 언어 코드를 기준으로 해당 언어 파일이 자동으로 로드되도록 구현하였음",
        "지원 언어 약 40개에 대해 개별적으로 QA를 진행하며 텍스트 길이 차이로 인해 발생하는 레이아웃 깨짐 문제를 전수 확인하고 수정함. 언어마다 달라지는 UI 요소를 안정적으로 유지할 수 있도록 스타일 규칙과 컴포넌트 구조를 개선해 다국어 환경에서도 일관된 사용자 경험을 제공"
      ],
      "tech": ["Next.js", "TypeScript", "Node.js"]
    },
    {
      "id": "P5",
      "title": "S-Certification Gamification (2024.11 - 2025.01)",
      "description": "임직원들이 신제품 관련 지식을 학습하고 테스트할 수 있도록 설계된 게임형 퀴즈 웹 서비스입니다. 어드민과 클라이언트 화면을 모두 구현하며 UI 구조 설계와 공통 컴포넌트 개발을 중심으로 프론트엔드 전반에 기여했습니다. 특히 테이블, 폼, 이메일 템플릿 등 재사용 가능한 컴포넌트를 구축하고, 다국어 환경에서 일관된 사용자 경험을 제공하기 위한 UI 자동화 로직 등 다양한 기능 개선 작업을 수행했습니다.",
      "do": [
        "DBeaver를 활용하여 테스트용 데이터베이스 서버를 구축",
        "Shadcn UI와 TanStack 라이브러리를 활용하여 데이터 테이블 컴포넌트 작업. 테이블 내 정렬 등 추가 기능 구현",
        "캠페인 생성 폼에 필요한 비즈니스 로직 설계 및 구현",
        "이메일 클라이언트에서 발생하는 CSS 호환성 문제에 대해 고민하고 문제를 해결하면서 디자인 시안을 정확하게 반영하기 위한 템플릿 개발",
        "다국어 적용 시 언어별 텍스트 길이 차이로 인해 타이틀 영역의 CSS가 깨지는 문제가 발생해, 이를 자동화하여 처리하기 위해 관련 라이브러리를 도입. 텍스트의 실제 너비를 계산해 폰트 크기를 동적으로 조절하는 방식으로 로직을 개선해, 언어에 관계없이 일관된 UI가 유지되도록 함"
      ],
      "tech": ["Next.js", "TypeScript", "Prisma", "PostgreSQL"]
    },
    {
      "id": "P6",
      "title": "AI Chat 프론트엔드 개발 (2024.11 - 2024.12)",
      "description": "제품 관련 질문에 답변하는 AI 챗봇 서비스를 개발했습니다. 반응형 포함 전체 프론트엔드 화면 구현과 다국어 지원 기능, 약관 및 피드백 등의 일부 기능을 개발했으며, 모델 테스트와 QA를 포함한 운영 테스트 및 유지보수까지 담당했습니다.",
      "do": [
        "DBeaver를 활용하여 테스트용 데이터베이스 서버를 구축",
        "브라우저 언어 설정에 따라 약관(terms) 언어가 자동으로 변경되도록 로직을 설계하고, 다국어 처리 라이브러리(i18n)를 활용해 다국어 지원 기능 구현",
        "OpenAI 및 클라이언트에서 제공한 언어 모델을 테스트하고 라우터에 따라 각 모델을 분기처리하여 동적으로 사용할 수 있도록 로직 구현",
        "유저 피드백 로직 구현",
        "개인정보처리방침 동의 로직 구현"
      ],
      "tech": ["Next.js", "TypeScript", "Prisma", "PostgreSQL"]
    },
    {
      "id": "P7",
      "title": "BIEN 사내 홈페이지 개발 (2024.08)",
      "description": "사내 홈페이지를 Next.js 기반으로 전면 리뉴얼하며 프론트엔드 구조를 설계하고, 서비스 운영을 위한 콘텐츠 관리 환경(Strapi v5)과 SEO 관련 기능들을 안정적으로 구축·유지보수하고 있습니다.",
      "do": [
        "Chrome Lighthouse로 페이지의 시맨틱 구조 전반을 점검하며 누락된 요소나 비표준 마크업을 보완하고, LCP를 포함한 주요 성능 지표를 개선",
        "Next.js App Router에서 제공하는 sitemap 기능을 활용해 기존 Strapi v5 기반 사이트맵을 서비스 구조에 맞는 형태로 변환하고, sitemap.xml을 재구성함. 그 결과 구글 크롤링이 보다 안정적이고 효율적으로 이루어지도록 개선함",
        "Google Search Console에 사이트를 등록하여 크롤링 최적화 과정을 경험하고 실 서비스 환경에서 발생한 SEO 비노출 문제를 분석 및 해결함"
      ],
      "tech": ["Next.js", "TypeScript", "Strapi-5"]
    }
  ]
}
